# Data analysis warmup exercise

In [3]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df=pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 1. Display top 3 rows

In [4]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## 2. Display last 3 rows

In [5]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 3. find the shape of dataset

In [8]:
df.shape

(7, 3)

In [9]:
df.shape[0]

7

In [10]:
df.shape[1]

3

## 4. get the information like total rows, col, and memory requirement

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## 5. check the null values in datasets

In [13]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [14]:
df['Name'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: Name, dtype: bool

## 6. get overall statistics

In [15]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

## 7. find uniwue values from gender column

In [19]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [20]:
df['Gender'].nunique()

2

## 8. get count of unique values

In [22]:
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

## 9. total number of students having marks between 90 to 100 inclusive

In [28]:
len(df[(df.Marks>=90)&(df.Marks<=100)])

4

In [35]:
sum([df['Marks'].between(90,100)])

0    1
1    0
2    1
3    0
4    1
5    0
6    1
Name: Marks, dtype: int32

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

## 10. find avg marks

In [36]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [37]:
df['Marks'].mean()

92.14285714285714

In [40]:
df[df.Marks==df.Marks.max()]

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female

## 11. apply()

In [41]:
def marks(x):
    return x//2;

In [42]:
df['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [43]:
df['half_marks'] = df['Marks'].apply(marks)
df

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

insted of using function we can pass directly a lambda function

In [44]:
df['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [45]:
df['Gender'].map({'Male':0,'Female':1})

0    0
1    1
2    1
3    0
4    0
5    1
6    1
Name: Gender, dtype: int64

In [46]:
df['male_female'] =df['Gender'].map({'Male':0,'Female':1})

In [47]:
df

      Name  Marks  Gender  half_marks  male_female
0  Priyang     98    Male          49            0
1   Aadhya     89  Female          44            1
2   Krisha     99  Female          49            1
3   Vedant     87    Male          43            0
4   Parshv     90    Male          45            0
5   Mittal     83  Female          41            1
6  Archana     99  Female          49            1

## 12. drop columns

In [49]:
df.drop(['half_marks','male_female'],axis=1, inplace=True)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 13.print the name of columns

In [50]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

## 14. sort tha dataframes according marks

In [51]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [53]:
df.sort_values(by='Marks')

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

## 15. display the name and marks of female

In [59]:
df[df['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99